// обработка парсит все заранее сохраненые HTML-файлы из указанного каталога. В данном случае структура настроена на шаблон
// анкетирования WordPress. 
// разбирается дерево DOM, ответы хранятся в JSON, который тоже разбирается. Картинки к ответам загружаются по прямым ссылкам, полученным
// при разборе HTML. Полученные вопросы с картинками и правильным ответом пишутся в справочники самописной конфигурации.

&НаСервере
Процедура ЗагрузкаНаСервере()   
	
	Если ОбъектТестирования.Пустая() Тогда
		Сообщить("Выберите или создайте новый объект тестирования и повторите загрузку");
		Возврат;
	КонецЕсли;
	
	
	МассивФайлов = НайтиФайлы("C:\tests\", "*.html", ложь);
	Для каждого ЭлементМассива Из МассивФайлов Цикл
		ЧтениеHTML = Новый ЧтениеHTML;         
		ЧтениеHTML.ОткрытьФайл(ЭлементМассива.ПолноеИмя, "UTF8");
              
		ПостроительDOM = Новый ПостроительDOM;        
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеHTML); 
		
		// читаем текущий раздел
		//Сообщить(СокрЛП(ДокументDOM.ПолучитьЭлементыПоИмени("title")[0].ТекстовоеСодержимое));
		Раздел = (СокрЛП(ДокументDOM.ПолучитьЭлементыПоИмени("h1")[0].ТекстовоеСодержимое));
		Раздел = Лев(Раздел, СтрДлина(Раздел)-3);
		СсылкаРаздел = Справочники.Разделы.НайтиПоНаименованию(Раздел);
		Если СсылкаРаздел.Пустая() Тогда
			ОбъектРаздел = Справочники.Разделы.СоздатьЭлемент();
			ОбъектРаздел.Владелец = ОбъектТестирования;
			ОбъектРаздел.Наименование = Раздел;
			ОбъектРаздел.Записать();
			СсылкаРаздел = ОбъектРаздел.Ссылка;
		КонецЕсли;	
		
		
		// собираем вопросы и ответы к ним
		ЭлементыHTML = ДокументDOM.ПолучитьЭлементыПоИмени("div");                
		МассивВопросов = Новый Массив;
		Для каждого ЭлДив Из ЭлементыHTML Цикл
			
			Если ЭлДив.ИмяКласса = "wpProQuiz_question" Тогда
			    // нашли блок вопроса
				Для Каждого Эл ИЗ ЭлДив.ДочерниеУзлы Цикл
					Если Эл.ИмяУзла = "div" Тогда	
						// нашли блок текста этого вопроса
						//Сообщить(СокрЛП(Эл.ТекстовоеСодержимое));
						Вопрос = СокрЛП(Эл.ТекстовоеСодержимое);
						СсылкаВопрос = Справочники.Вопросы.НайтиПоРеквизиту("Вопрос", Вопрос,,ОбъектТестирования);
						Если СсылкаВопрос.Пустая() Тогда
							ОбъектВопрос = Справочники.Вопросы.СоздатьЭлемент();
							ОбъектВопрос.Владелец = ОбъектТестирования;
							ОбъектВопрос.Раздел = СсылкаРаздел;
							ОбъектВопрос.Вопрос = Вопрос;
							ОбъектВопрос.Код = Лев(Вопрос, 5);
							ОбъектВопрос.НомерВопросаВКомплекте = Сред(Вопрос,4,2);
						Иначе
							ОбъектВопрос = 	СсылкаВопрос.ПолучитьОбъект();
						КонецЕсли;	
						
						//сохраняем ссылку на картинку
						Если Эл.ПолучитьЭлементыПоИмени("a").Количество() > 0 Тогда
							//в вопросе есть картинка, сохраняем

						    Соединение = Новый HTTPСоединение("1-exam.ru");
						    Запрос = Новый HTTPЗапрос(Эл.ПолучитьЭлементыПоИмени("a")[0].Гиперссылка);
						    Ответ = Соединение.Получить(Запрос);
							ДвоичныеДанныеКартинки = Ответ.ПолучитьТелоКакДвоичныеДанные();							
							
							ОбъектВопрос.Картинка = Новый ХранилищеЗначения(ДвоичныеДанныеКартинки, Новый СжатиеДанных());
							
						КонецЕсли;	
						
						НомерОтвета = 1;
					ИначеЕсли Эл.ИмяУзла = "ul" Тогда		
						// нашли блок ответов этого вопроса
						Для Каждого ЭлОтвет Из Эл.ДочерниеУзлы Цикл
							Если ЭлОтвет.ИмяУзла = "li" Тогда
								//Сообщить(Строка(НомерОтвета) + " " + СокрЛП(ЭлОтвет.ТекстовоеСодержимое));
								Ответ = Строка(НомерОтвета) + " " + СокрЛП(ЭлОтвет.ТекстовоеСодержимое);
								ОбъектВопрос["Ответ"+НомерОтвета] = Ответ;
								НомерОтвета = НомерОтвета + 1;
							КонецЕсли;	
						КонецЦикла;
						ОбъектВопрос.Записать();
						МассивВопросов.Добавить(ОбъектВопрос);
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
		
		// парсим блок ответов
		ЭлементыHTML = ДокументDOM.ПолучитьЭлементыПоИмени("script");
		Для Каждого ЭлСкрипт Из ЭлементыHTML Цикл
			Если Найти(ЭлСкрипт.ТекстовоеСодержимое, "json:") > 0 Тогда
				СтрокаJSON = СокрЛП(ЭлСкрипт.ТекстовоеСодержимое);
				СтрокаJSON = Прав(СтрокаJSON, СтрДлина(СтрокаJSON) - Найти(СтрокаJSON, "json")-6);
				СтрокаJSON = Лев(СтрокаJSON,СтрДлина(СтрокаJSON)-14);
			КонецЕсли;	
		КонецЦикла;	
		ЧтениеHTML.Закрыть();            
		
		Если СтрДлина(СтрокаJSON) > 0 Тогда 
			// читаем JSON с ответами
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
			ИндексВопроса = 0;
			Пока ЧтениеJSON.Прочитать() Цикл
				
				Структура = Прочитатьjson(ЧтениеJSON);
				Если ТипЗнч(Структура) = Тип("Структура") Тогда
					// ответы лежат в массиве correct, индекс в массиве равен номеру ответа
					// правильный ответ имеет значение = 1
					//Сообщить(Структура.Correct.Найти(1)+1);
					ПравильныйОтвет = Структура.Correct.Найти(1)+1;
					ОбъектВопрос = МассивВопросов[ИндексВопроса];
					ОбъектВопрос.ПравильныйВариантОтвета = ПравильныйОтвет;
					ОбъектВопрос.Записать();
					ИндексВопроса = ИндексВопроса + 1;
				Иначе
				КонецЕсли;	
				
			КонецЦикла;	
			ЧтениеJSON.Закрыть();
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузкаНаСервере();
	Предупреждение("Загрузка завершена");
КонецПроцедуры

// исходные данные - примеры файла HTML, JSON и разбор ссылки на картинку:
//<div class="wpProQuiz_question" style="margin: 10px 0 0 0;">
//	<div class="wpProQuiz_question_text">
//		<p>02.14 Для партнера не определены цены, по которым ему отгружается товар. Какой вид цен будет установлен по умолчанию при выборе партнера в документе &#171;Реализация товаров и услуг&#187;?</p>
//	</div>
//	<ul class="wpProQuiz_questionList" data-question_id="1950" data-type="single">
//														
//		<li class="wpProQuiz_questionListItem" data-pos="0">
//								
//																								<span ></span>
//			<label>
//				<input class="wpProQuiz_questionInput" type="radio" name="question_149_1950" value="1"> Будет установлен вид цен "Оптовая" при продаже с оптового склада и вид цен "Розничная" при продаже товаров с розничного склада.									</label>
//							
//		</li> 
//						 								
//		<li class="wpProQuiz_questionListItem" data-pos="1">
//								
//																								<span ></span>
//			<label>
//				<input class="wpProQuiz_questionInput" type="radio" name="question_149_1950" value="2"> Будет установлен тот вид цен, который указан для пользователя, как основной тип цен продажи.									</label>
//							
//		</li> 
//						 								
//		<li class="wpProQuiz_questionListItem" data-pos="2">
//								
//																								<span ></span>
//			<label>
//				<input class="wpProQuiz_questionInput" type="radio" name="question_149_1950" value="3"> Значения вида цены в документе заполнено не будет.									</label>
//							
//		</li> 
//	</ul>
//</div>


//<script type="text/javascript">
//		jQuery(document).ready(function($) {
//			$('#wpProQuiz_149').wpProQuizFront({
//				quizId: 149,
//				mode: 1,
//				globalPoints: 14,
//				timelimit: 0,
//				resultsGrade: [0],
//				bo: 6016,
//				qpp: 0,
//				catPoints: [14],
//				formPos: 0,
//				lbn: "\u0417\u0430\u0432\u0435\u0440\u0448\u0438\u0442\u044c \u0442\u0435\u0441\u0442",
//				json: {"1937":{"type":"single","id":1937,"catId":0,"points":1,"correct":[0,0,0,0,0,1]},"1938":{"type":"single","id":1938,"catId":0,"points":1,"correct":[0,0,0,1]},"1939":{"type":"single","id":1939,"catId":0,"points":1,"correct":[0,1,0]},"1940":{"type":"single","id":1940,"catId":0,"points":1,"correct":[0,1,0,0]},"1941":{"type":"single","id":1941,"catId":0,"points":1,"correct":[0,0,0,0,1]},"1942":{"type":"single","id":1942,"catId":0,"points":1,"correct":[0,1,0,0]},"1943":{"type":"single","id":1943,"catId":0,"points":1,"correct":[0,0,0,0,0,1]},"1944":{"type":"single","id":1944,"catId":0,"points":1,"correct":[0,0,0,0,0,1]},"1945":{"type":"single","id":1945,"catId":0,"points":1,"correct":[0,0,0,0,1]},"1946":{"type":"single","id":1946,"catId":0,"points":1,"correct":[0,0,0,0,1]},"1947":{"type":"single","id":1947,"catId":0,"points":1,"correct":[0,0,0,0,1,0]},"1948":{"type":"single","id":1948,"catId":0,"points":1,"correct":[1,0,0,0,0]},"1949":{"type":"single","id":1949,"catId":0,"points":1,"correct":[0,0,0,0,1]},"1950":{"type":"single","id":1950,"catId":0,"points":1,"correct":[0,0,1]}}			});
//		});
//		</script>


//{
//"1937":{"type":"single","id":1937,"catId":0,"points":1,"correct":[0,0,0,0,0,1]},
//"1938":{"type":"single","id":1938,"catId":0,"points":1,"correct":[0,0,0,1]},
//"1939":{"type":"single","id":1939,"catId":0,"points":1,"correct":[0,1,0]},
//"1940":{"type":"single","id":1940,"catId":0,"points":1,"correct":[0,1,0,0]},
//"1941":{"type":"single","id":1941,"catId":0,"points":1,"correct":[0,0,0,0,1]},
//"1942":{"type":"single","id":1942,"catId":0,"points":1,"correct":[0,1,0,0]},
//"1943":{"type":"single","id":1943,"catId":0,"points":1,"correct":[0,0,0,0,0,1]},
//"1944":{"type":"single","id":1944,"catId":0,"points":1,"correct":[0,0,0,0,0,1]},
//"1945":{"type":"single","id":1945,"catId":0,"points":1,"correct":[0,0,0,0,1]},
//"1946":{"type":"single","id":1946,"catId":0,"points":1,"correct":[0,0,0,0,1]},
//"1947":{"type":"single","id":1947,"catId":0,"points":1,"correct":[0,0,0,0,1,0]},
//"1948":{"type":"single","id":1948,"catId":0,"points":1,"correct":[1,0,0,0,0]},
//"1949":{"type":"single","id":1949,"catId":0,"points":1,"correct":[0,0,0,0,1]},
//"1950":{"type":"single","id":1950,"catId":0,"points":1,"correct":[0,0,1]}
//}


/// рисунки
//вопрос, содержащий рисунок:
//<div class="wpProQuiz_question_text">
//	<p>10.027 На рисунке представлена:</p>
//	<p><a href="/wp-content/uploads/2015/08/Platforma_10-27.png" rel="lightbox[819]"><img class=" size-full aligncenter" src="/wp-content/uploads/2015/08/Platforma_10-27.png" alt="10-27" /></a></p>
//</div>
//тогда полная ссылка на рисунок будет:
//http://1-exam.ru/wp-content/uploads/2015/08/Platforma_10-27.png
//то-есть к перед href или src надо дописать "http://1-exam.ru"
