// пример использования регулярных выражений в 1С
// в переданной строке находим дату по шаблону и возвращаем ее. 
//	. - любой символ
//	+ - один или более раз, пример ".+" - один или более любой символ.
//	* - ноль или более раз, пример ".*" - любое количество любых символов (даже ни одного).
//	[n-m] - символ от m до n, пример: "[0-9]+" - одна или более цифр(а).
//	\d - цифра, пример \d+ - одна или более цифр(а).
//	\D - не цифра.
//	\s - пробельный символ - ТАБ, пробел, перенос строки, возврат каретки и т.п.
//	\S - непробельный символ.
//	\w - буква, цифра, подчеркивание.
//	\W - не буква, не цифра и не подчеркивание соответственно.
//	^ - начало текста, например "^\d+" - строка начинается с цифры.
//	$ - конец текста, например "\D+$" - строка заканчивается НЕ цифрой.
//	{m,n} - шаблон для от m до n символов, например "\d{2,4}" - от двух до четырех цифр. Можно указать одну и всего цифру для строгого соответвия.
//	\ - экранирует спецсимволы. Например, "\." - символ точки.

// 31.10.2015 = "\d{2}\.\d{2}\.\d{4}"

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ШаблонДата = "\d{2}\.\d{2}\.\d{4}";
	ШаблонКвартал = "\d{1}\s\S{7}\s\d{4}";
	
	АнализируемыйТекст = "Дополнительный лист составлен 30.11.2015(по договорам теплоснабжения )";
	//АнализируемыйТекст = "Дополнительный лист составлен 30.09.2015 г.";
	
	НайденнаяДата =  РегулярныеВыражения_Выполнить(ШаблонДата, АнализируемыйТекст);
	Сообщить(НайденнаяДата[0].Значение);
	
//	АнализируемыйТекст = "Налоговый период, год 2 квартал 2015 г.";
	АнализируемыйТекст = "2 квартал 2015г.";
	
	НайденнаяДата =  РегулярныеВыражения_Выполнить(ШаблонКвартал, АнализируемыйТекст);
    Сообщить(НайденнаяДата[0].Значение);
	
КонецПроцедуры

Функция РегулярныеВыражения_Выполнить(Шаблон, АнализируемыйТекст)

	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.MultiLine = Ложь;
	RegExp.Global = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern = Шаблон;
	
    РезультатАнализаСтроки = RegExp.Execute(АнализируемыйТекст);

    МассивВыражений = Новый Массив;

    Для Каждого Выражение Из РезультатАнализаСтроки Цикл

        МассивВыражений.Добавить(Выражение.Value);

    КонецЦикла;

    Возврат МассивВыражений;

КонецФункции
