// Отчет(обработка) показывает, какие документы зарегистрированы к обмену на выбранном узле на момент формирования отчета.
// Работает на любой конфигурации. Динамически собирается текст запроса по всем документам конфигурации, которые входят в этот 
// узел обмена. Данные выводятся в таблицу значений на форме отчета.

&НаСервере
Процедура СформироватьНаСервере()
	
	ДатаВыгрузки = ТекущаяДатаСеанса();

	Запрос = Новый Запрос;
	
	Запрос.Текст = "";
	
	ШаблонТекста = "ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.ИмяТаблицы.Изменения
	|ГДЕ
	|	Узел = &Узел";
	
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		Если Метаданные.ПланыОбмена.ДокументыПоОрганизации.Состав.Содержит(Документ) Тогда 
			
			ЗапросДокумента = СтрЗаменить(ШаблонТекста, "ИмяТаблицы", Документ.Имя);
			
			Если Запрос.Текст = "" Тогда
				Запрос.Текст = ЗапросДокумента
			Иначе
				Запрос.Текст = Запрос.Текст + " ОБЪЕДИНИТЬ ВСЕ " + ЗапросДокумента;
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;		
	
	Запрос.УстановитьПараметр("Узел", ПланыОбмена.ДокументыПоОрганизации.НайтиПоКоду("002"));
	
	ТаблицаДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
